index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-08-10 Mon 12:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Vaibhav Karve</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Vaibhav Karve" />
<link rel="stylesheet" type="text/css" href="css/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Vaibhav Karve
<br />
<span class="subtitle"><a href="Vaibhav Karve CV.pdf">CV</a>&nbsp;&nbsp;&nbsp;&nbsp; <a href="https://github.com/vaibhavkarve">GitHub</a> &nbsp;&nbsp;&nbsp;&nbsp; <a href="https://www.linkedin.com/in/vaibhav-karve/">LinkedIn</a> &nbsp;&nbsp;&nbsp;&nbsp; <a href="https://git.math.illinois.edu/vkarve2">GitLab</a></span>
</h1>
<p>
I am a PhD student at the <a href="https://math.illinois.edu">Department of Mathematics</a> at the University
of Illinois at Urbana-Champaign.
</p>

<p>
My research interests lie in graph theory, logic, algorithms and
computational topology. I am currently writing my doctoral thesis,
titled <i>Graphical structure of unsatisfiable boolean formulas</i> which
combines the tools of graph theory and topology to analyze boolean
satisfiability &#x2013; a classic problem in logic and computer science that
asks if there exists an interpretation that satisfies a boolean
formula.
</p>

<p>
I am also looking to extend my doctoral work towards the upcoming and
adjacent field of formalized mathematics (a computer-assisted
approach) and interactive theorem proving.
</p>

<div id="outline-container-org32488d5" class="outline-2">
<h2 id="org32488d5">Research</h2>
<div class="outline-text-2" id="text-org32488d5">
</div>
<div id="outline-container-org1bc6d39" class="outline-3">
<h3 id="org1bc6d39"><a href="satisfiability/index.html">Satisfiability</a>  <sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup></h3>
</div>
<div id="outline-container-org55b2bda" class="outline-3">
<h3 id="org55b2bda">Manhattan traffic</h3>
</div>
<div id="outline-container-orge9b85fd" class="outline-3">
<h3 id="orge9b85fd">Geometry in Lean</h3>
</div>
<div id="outline-container-org6d146c7" class="outline-3">
<h3 id="org6d146c7">Past projects</h3>
</div>
</div>

<div id="outline-container-org3a75398" class="outline-2">
<h2 id="org3a75398">Teaching</h2>
<div class="outline-text-2" id="text-org3a75398">
<p>
My ever-evolving <a href="Teaching_Philosophy_Statement.pdf">teaching philosophy</a>.
</p>
</div>
<div id="outline-container-org68e17cd" class="outline-3">
<h3 id="org68e17cd">LeanTeach 2020</h3>
</div>
<div id="outline-container-org602bc00" class="outline-3">
<h3 id="org602bc00">Computational mathematics</h3>
</div>
<div id="outline-container-orga2ea15e" class="outline-3">
<h3 id="orga2ea15e">Classical constructions</h3>
</div>
<div id="outline-container-org03f2c35" class="outline-3">
<h3 id="org03f2c35">Past courses</h3>
</div>
</div>

<div id="outline-container-orga8c137f" class="outline-2">
<h2 id="orga8c137f">Notes</h2>
<div class="outline-text-2" id="text-orga8c137f">
</div>
<div id="outline-container-orgeb0dbb5" class="outline-3">
<h3 id="orgeb0dbb5">How to</h3>
<div class="outline-text-3" id="text-orgeb0dbb5">
<ul class="org-ul">
<li>&#x2026; set up this website
<ul class="org-ul">
<li>I followed the steps <a href="https://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html">here</a>.</li>
<li>Also set up the sitemap.</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org2c38849" class="outline-2">
<h2 id="org2c38849">Currently Reading</h2>
<div class="outline-text-2" id="text-org2c38849">
</div>
<div id="outline-container-org7094064" class="outline-3">
<h3 id="org7094064">Geometry</h3>
</div>
<div id="outline-container-orgbaec00a" class="outline-3">
<h3 id="orgbaec00a">Logic</h3>
</div>
<div id="outline-container-orgba71cb9" class="outline-3">
<h3 id="orgba71cb9">Functional programming</h3>
</div>
</div>
<div id="outline-container-org965c899" class="outline-2">
<h2 id="org965c899">Everything else</h2>
<div class="outline-text-2" id="text-org965c899">
</div>
<div id="outline-container-org662acfc" class="outline-3">
<h3 id="org662acfc">Kaprekar's constant visualized</h3>
</div>
<div id="outline-container-org0f1c2e5" class="outline-3">
<h3 id="org0f1c2e5">Plots and graphs I generated</h3>
</div>
<div id="outline-container-org9ebafa4" class="outline-3">
<h3 id="org9ebafa4">First attempt at publishing package : multihypergraph on PyPI</h3>
</div>
<div id="outline-container-org124015b" class="outline-3">
<h3 id="org124015b">Recognizing patterns in New York traffic : 4 min video</h3>
</div>
<div id="outline-container-org30f56d7" class="outline-3">
<h3 id="org30f56d7">Slides from my talks</h3>
</div>
<div id="outline-container-orgdbaad92" class="outline-3">
<h3 id="orgdbaad92">Photos from conferences</h3>
</div>
<div id="outline-container-org273a228" class="outline-3">
<h3 id="org273a228">My Klein bottle</h3>
</div>
<div id="outline-container-org86bfb07" class="outline-3">
<h3 id="org86bfb07"></h3>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
this work is currently funded by the <a href="https://math.illinois.edu/academics/graduate-program/funding/graduate-awards-and-fellowships/david-g-bourgin-mathematics">David G. Bourgin Mathematics Fellowship</a>.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Vaibhav Karve</p>
<p class="date">Created: 2020-08-10 Mon 12:10</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
